# 1이상 양의 정수를 입력 받는다
#  - 예외처리: 0또는 음수의 경우 재입력 메시지 출력
# 짝수 또는 홀수 판별 후 출력
# 3의 배수 판단 후 출력
# 7의 배수 판단 후 출력
# 20000 입력 시 종료

# 키보드로 입력

# 입력 값 예외 처리

# 20000 이면 프로그램 종료

# 입력 횟수와 입력 값 출력

# 짝수 또는 홀수 판별 후 출력

# 3의 배수 판별 후 출력

# 7의 배수 판별 후 출력

"------------------------------"
# while True: #True 면 일단 무한루프.
#     num = int(input("정수를 입력 하세요: "))

#     if num == 1:
#         #탈출
#         break # 브레이크 만나면 제일 위에 있는 반복문을 중지시킨다.

# flag = True

# while flag: #True 면 일단 무한루프.
#     num = int(input("정수를 입력 하세요: "))

#     if num == 1:
#         #탈출
#         flag = False # 브레이크 만나면 제일 위에 있는 반복문을 중지시킨다.
